/**
 * Created on 08.08.2018.
 *
 * @author Aleks Sidorenko (alek.sidorenko1979@gmail.com).
 * @version $Id$.
 * @since 0.1.
 */
package ru.job4j.conditional_statements_4.maximum_of_three_numbers_4_4;

/*
Максимум из трех чисел [#190]
  Администратор,  02.06.18 4:34
1. В класс Max из задания #189 добавить новый метод

public int max(int first, int second, int third)

2. Метод должен возвращать максимум из трех чисел

3. Для вычисления максимума их трех чисел надо использовать метод

public int max(int first, int second)

несколько раз.

int temp = this.max(first, second);
...
return temp;

4. В этом методе public int max(int first, int second, int third) не должно быть if или тернарного оператора.

Что делать не надо.

1. Здесь не надо использовать Scanner, System.in, System.out.println.

2. В программе не должно быть ввода и вывода данных.

3. Код всей программы проверяется через тесты.

4. Не надо создавать метод public static void main(String[] args) - так вы занимаетесь ручным тестированием. В курсе используется только автоматическое тестирование за счет JUnit.
5. В классах не надо добавлять методы get set.

Задание.

1. В папке со своим именем создайте задачу c именем этой задачи.
2. Заполните поле исходный код - укажите там ссылку на коммит к этой задаче.
3. Выполните операцию начать и укажите отвественного Петра Арсентьева.
4. Переходите к следующей задаче.
 */