/**
 * Created on 05.07.2017.
 *
 * @author Aleks Sidorenko (mailto:alek.sidorenko1979@gmail.com)
 * @version $Id$
 * @since 0.1
 */
package ru.job4j.inheritance_2;

/*
1. Создать классы - профессий. [#6828]

Дополнительная литература:

1) Java 8, Полное руководство - Герберт Шилдт. Глава 6 (стр. 155 - 162)
2) Библиотека профессионала. Java. Том 1. Основы - Кей Хостманн, Гари Корнелл. Глава 4 (стр. 131 - 137)
3) Head First Java - Кэти Сьерра и Берт Бейтс. Глава 2 (стр. 57)

* В дополнительной литературе указаны примерные страницы!


1. Прочитайте про UML диаграммы в Википедии.
2. Используя сервис www.draw.io нарисовать схему.
3. Сделать скриншот вашей работы и добавить его в задачу.

Задание.

1. Создать класс профессия. с полями: имя, профессия. без методов.
2. Создать класс доктор наследник от профессии.
3. Доктор должен иметь методы: лечить пациента. Пациент - это новый класс. В пациент имеет поле имя.
4. Создать класс инженер наследника от професси.
5. Инженер должен иметь методы. строить дом. Дом - отдельный класс.
6. Создать класс учитель. Учитель имеет методы учить студента.
7. Внутри методы ничего делать не должны. Они должны быть пустые.

Задание.

1. Доработайте требуемый функционал.
2. В задачу добавить скрин с картинками.
3. Создайте задачу в своей папке с имением. 1. Создать классы - профессий.
4. Выставите ответственного Петр Арсентьева.
 */